app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 2)
---
  def index
    @users = User.find(:all)

SELECT * FROM `users` WHERE (referral_code = 'jhgjhbv')
---
  def show
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (referral_code = '123124hhhjg') LIMIT 1
---
  def new



    #if a referral code is set, let's check to make sure it is valid, otherwise, get rid of it.
    result_count= User.find(:all, :conditions  => ["referral_code = ?", params[:id] ] ).length

SELECT `users`.id FROM `users` WHERE (`users`.`email` = BINARY '') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`referral_code` = 0) LIMIT 1
---
  def create
    @user = User.new(params[:user])

    #Generate random, unique referral code

	#check to see if the email address has already been entered
	user_to_check=User.find_by_email(params[:user][:email])
	if !user_to_check.nil?
		redirect_to :action => 'success', :id=>user_to_check.referral_code
	else


		referral_unique=0

		while referral_unique==0
		  #generate a new code that is six digits
		  good_random_number=0  #set the variable for the loop
		  while good_random_number==0
			#generate the random number- It may be less than six digits!!
			new_referral_code = rand(1000000)
			#make sure referral code is six (6) digits
			if new_referral_code.to_s.length == 6
			  good_random_number= 1
			end
		  end

		  #make sure referral code is unique
		  if User.find_by_referral_code(new_referral_code).nil?

INSERT INTO `users` (`created_at`, `updated_at`, `referral_code`, `email`, `ip_address`) VALUES('2011-02-04 22:32:00', '2011-02-04 22:32:00', NULL, 'jasonscotthamilton@gmail.com', NULL)
---



		  if @user.save